# Lesson5 - SQLite

In [1]:
# SQLite is included in the standard library (since Python 2.5)
# https://sqlitebrowser.org/dl/
import sqlite3

## Creat a Database

In [2]:
conn=sqlite3.connect('test.db')

## Create a Table

In [3]:
conn.execute('''CREATE TABLE COMPANY
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         SALARY         REAL);''')
conn.close()

## Insert into a table

In [4]:
conn = sqlite3.connect('test.db')

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (1, 'Paul', 32, 'California', 20000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (2, 'Allen', 25, 'Texas', 15000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (3, 'Teddy', 23, 'Norway', 20000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (4, 'Mark', 25, 'Rich-Mond ', 65000.00 )");

conn.commit()
conn.close()

## Select from a table

In [5]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
    print ("ID = ", row[0])
    print ("NAME = ", row[1])
    print ("ADDRESS = ", row[2])
    print ("SALARY = ", row[3], "\n")


conn.close()

ID =  1
NAME =  Paul
ADDRESS =  California
SALARY =  20000.0

ID =  2
NAME =  Allen
ADDRESS =  Texas
SALARY =  15000.0

ID =  3
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0

## Update a table

In [6]:
conn = sqlite3.connect('test.db')
conn.execute("UPDATE COMPANY set SALARY = 25000.00 where ID = 1")
conn.commit()
conn.close()

In [7]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
    print ("ID = ", row[0])
    print ("NAME = ", row[1])
    print ("ADDRESS = ", row[2])
    print ("SALARY = ", row[3], "\n")


conn.close()

ID =  1
NAME =  Paul
ADDRESS =  California
SALARY =  25000.0

ID =  2
NAME =  Allen
ADDRESS =  Texas
SALARY =  15000.0

ID =  3
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0

## Delete a row

In [8]:
conn = sqlite3.connect('test.db')
conn.execute("DELETE from COMPANY where ID = 2;")
conn.commit()
conn.close()

In [9]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
    print ("ID = ", row[0])
    print ("NAME = ", row[1])
    print ("ADDRESS = ", row[2])
    print ("SALARY = ", row[3], "\n")


conn.close()

ID =  1
NAME =  Paul
ADDRESS =  California
SALARY =  25000.0

ID =  3
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0

## Join tables

In [10]:
conn = sqlite3.connect('test.db')
conn.execute('''CREATE TABLE DEPARTMENT(
   ID INT PRIMARY KEY      NOT NULL,
   DEPT           CHAR(50) NOT NULL,
   EMP_ID         INT      NOT NULL)''')
conn.close()

In [11]:
conn = sqlite3.connect('test.db')

conn.execute("INSERT INTO DEPARTMENT (ID, DEPT, EMP_ID)\
VALUES (1, 'IT Billing', 1 );")

conn.execute("INSERT INTO DEPARTMENT (ID, DEPT, EMP_ID)\
VALUES (2, 'Engineering', 2 );")

conn.execute("INSERT INTO DEPARTMENT (ID, DEPT, EMP_ID)\
VALUES (3, 'Finance', 4 );")

conn.execute("INSERT INTO DEPARTMENT (ID, DEPT, EMP_ID)\
VALUES (4, 'Planning', 6 );")

conn.execute("INSERT INTO DEPARTMENT (ID, DEPT, EMP_ID)\
VALUES (5, 'Logistic', 7 );")

conn.commit()
conn.close()

In [12]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT ID, DEPT, EMP_ID FROM DEPARTMENT")
for row in cursor:
    print("ID = ", row[0])
    print("DEPT = ", row[1])
    print("EMP_ID = ", row[2], "\n")
conn.close()

ID =  1
DEPT =  IT Billing
EMP_ID =  1

ID =  2
DEPT =  Engineering
EMP_ID =  2

ID =  3
DEPT =  Finance
EMP_ID =  4

ID =  4
DEPT =  Planning
EMP_ID =  6

ID =  5
DEPT =  Logistic
EMP_ID =  7

In [13]:
conn.close()

In [14]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT EMP_ID, NAME, DEPT FROM COMPANY INNER JOIN DEPARTMENT ON COMPANY.ID = DEPARTMENT.EMP_ID;")
for row in cursor:
    print(row)
conn.close()

(1, 'Paul', 'IT Billing')
(4, 'Mark', 'Finance')

## Rollback

In [15]:
conn = sqlite3.connect('test.db')

conn.execute("INSERT INTO DEPARTMENT (ID, DEPT, EMP_ID)\
VALUES (11, 'IT Billing', 1 );")

conn.rollback()
conn.commit()
conn.close()

In [16]:
conn = sqlite3.connect('test.db')

cursor = conn.execute("SELECT ID, DEPT, EMP_ID FROM DEPARTMENT")
for row in cursor:
    print("ID = ", row[0])
    print("DEPT = ", row[1])
    print("EMP_ID = ", row[2], "\n")
conn.close()

ID =  1
DEPT =  IT Billing
EMP_ID =  1

ID =  2
DEPT =  Engineering
EMP_ID =  2

ID =  3
DEPT =  Finance
EMP_ID =  4

ID =  4
DEPT =  Planning
EMP_ID =  6

ID =  5
DEPT =  Logistic
EMP_ID =  7

In [17]:
conn = sqlite3.connect('test.db')
cursor = conn.execute("SELECT ID, DEPT, EMP_ID FROM DEPARTMENT")

first=cursor.fetchone()
remaining=cursor.fetchall()

conn.close()


print(first)
print(remaining)

(1, 'IT Billing', 1)
[(2, 'Engineering', 2), (3, 'Finance', 4), (4, 'Planning', 6), (5, 'Logistic', 7)]

In [18]:
conn = sqlite3.connect('test.db')
cursor = conn.execute("SELECT ID, DEPT, EMP_ID FROM DEPARTMENT")

all=cursor.fetchall()
first=cursor.fetchone()

conn.close()


print(all)
print(first)

[(1, 'IT Billing', 1), (2, 'Engineering', 2), (3, 'Finance', 4), (4, 'Planning', 6), (5, 'Logistic', 7)]
None

In [19]:
conn = sqlite3.connect('test.db')
cursor = conn.execute("SELECT ID, DEPT, EMP_ID FROM DEPARTMENT")

top2=cursor.fetchmany(2)
next2=cursor.fetchmany(2)
conn.close()


print(top2)
print(next2)

[(1, 'IT Billing', 1), (2, 'Engineering', 2)]
[(3, 'Finance', 4), (4, 'Planning', 6)]

In [57]:
import pandas as pd

conn = sqlite3.connect('test.db')
df = pd.read_sql_query("SELECT * FROM DEPARTMENT", conn)
conn.close()
df

   ID         DEPT  EMP_ID
0   1   IT Billing       1
1   2  Engineering       2
2   3      Finance       4
3   4     Planning       6
4   5     Logistic       7

In [28]:
con = sqlite3.connect("test.db")
cursor = con.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cursor.fetchall())

[('COMPANY',), ('DEPARTMENT',)]

In [29]:
con = sqlite3.connect("test.db")
cursor = con.execute("SELECT name FROM sqlite_master;")
print(cursor.fetchall())

[('COMPANY',), ('sqlite_autoindex_COMPANY_1',), ('DEPARTMENT',), ('sqlite_autoindex_DEPARTMENT_1',)]

# MySQL

In [55]:
# https://dev.mysql.com/downloads/installer/
# pip install mysql-connector-python
import mysql.connector

In [40]:
cnx = mysql.connector.connect(user='root', password='',
                              host='127.0.0.1',
                              database='test_database')

cursor = cnx.cursor()
query="SELECT * FROM test_database.new_table;"
cursor.execute(query)

for row in cursor:
    print(row)

cursor.close()
cnx.close()

(1, 'Jonh', 'Smith')
(2, 'Katie', 'Smith')
(3, 'Frank', 'Smith')

In [53]:
cnx = mysql.connector.connect(user='root', password='',
                              host='127.0.0.1',
                              database='test_database')

cursor = cnx.cursor()

add_member = "INSERT INTO new_table (ID, FirstName, LastName) VALUES (%s, %s, %s)"

data_member=(15, 'New', 'Member')

cursor.execute(add_member, data_member)

#cnx.commit()
cursor.close()
cnx.close()

In [54]:
cnx = mysql.connector.connect(user='root', password='',
                              host='127.0.0.1',
                              database='test_database')

cursor = cnx.cursor()
query="SELECT * FROM test_database.new_table;"
cursor.execute(query)

for row in cursor:
    print(row)

cursor.close()
cnx.close()

(1, 'Jonh', 'Smith')
(2, 'Katie', 'Smith')
(3, 'Frank', 'Smith')
(13, 'New', 'Member')

In [59]:
cnx = mysql.connector.connect(user='root', password='',
                              host='127.0.0.1',
                              database='test_database')

df = pd.read_sql_query("SELECT * FROM new_table", cnx)
cnx.close()
df

   ID FirstName LastName
0   1      Jonh    Smith
1   2     Katie    Smith
2   3     Frank    Smith
3  13       New   Member